hybridCentralSolvers/Tutorials/compressible/RiemanToro/Test4/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues 
(
    volScalarFieldValue T 250.0
    volScalarFieldValue p 100.0
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        box ( -1 -1 -1 ) ( 0.5 1  1 );
        fieldValues
        (
            volScalarFieldValue T 0.025
            volScalarFieldValue p 0.01
            volVectorFieldValue U (0 0 0)
        ); 
    } 
);


// ************************************************************************* //
